       IDENTIFICATION DIVISION.
       PROGRAM-ID. Program1.
       AUTHOR.  HCL.
       environment division.
       configuration section.
       DATA DIVISION.
       WORKING-STORAGE SECTION.     
       PROCEDURE DIVISION.
       DISPLAY "hello hi hy bye bye".
       goback.
       STOP RUN.
       end program Program1.
