000100 IDENTIFICATION DIVISION.                                         00010025
000200                                                                  00020026
000300 PROGRAM-ID.                    PROGRAM4.                         00030027
000400 AUTHOR.                        HCL     .                         00040026
000500 DATE-WRITTEN.                  FEB 2019.                         00050027
000600                                                                  00060026
000700******************************************************************00070026
002300                                                                  00230001
002400 ENVIRONMENT DIVISION.                                            00240001
002500                                                                  00250001
002600***************************************************************** 00260001
002700**                                                                00270001
002800**   CONFIGURATION SECTION                                        00280001
002900**                                                                00290001
003000******************************************************************00300001
003100                                                                  00310001
003200 CONFIGURATION SECTION.                                           00320001
003300                                                                  00330001
003400 SPECIAL-NAMES.                                                   00340026
003500      DECIMAL-POINT IS COMMA.                                     00350026
003600                                                                  00360026
003700******************************************************************00370026
003800**                                                                00380026
003900**   INPUT-OUTPUT SECTION                                         00390026
004000**                                                                00400026
004100******************************************************************00410026
004200                                                                  00420026
004300 INPUT-OUTPUT SECTION.                                            00430026
004400                                                                  00440026
004500 FILE-CONTROL.                                                    00450026
004600******************************************************************00460026
004700**                                                                00470026
004800**   DATA DIVISION                                                00480026
004900**                                                                00490026
005000******************************************************************00500026
005100                                                                  00510026
005200 DATA DIVISION.                                                   00520026
005300                                                                  00530026
005400******************************************************************00540026
005500**                                                                00550026
005600**   FILE SECTION                                                 00560026
005700**                                                                00570026
005800******************************************************************00580026
005900                                                                  00590026
006000 FILE SECTION.                                                    00600026
006100                                                                  00610026
006200******************************************************************00620026
006300**                                                                00630026
006400**  WORKING-STORAGE SECTION                                       00640026
006500**                                                                00650026
006600******************************************************************00660026
006700                                                                  00670026
006800 WORKING-STORAGE SECTION.                                         00680026
006900                                                                  00690026
007000 01 WS-WORKING-STORAGE.                                           00700026       
007100    12  WS-COMPUTATIONAL               PIC S9(9) VALUE +31 COMP.  00710026             
007200    12  WS-NUMERIC-EDITED              PIC -9(9) VALUE +0.        00720026   
007300    12  WS-NUMERIC-EDITED-REDEFINED                               00730026
007400        REDEFINES WS-NUMERIC-EDITED PIC X(10).                    00740026     
007500    12  WS-ALPHANUMERIC             PIC X(10) VALUE 0.            00750026 
007500    12  WS-COMP3                    COMP-3 VALUE '123'.           00750026 
007500    12  WS-COMP3-NUM                PIC S9(3) VALUE 0.            00750026
007500    12  WS-COMP3-ALNUM              PIC X(3) VALUE 0.             0750026 
009040*----------------------------------------------------------------*00904026
009050 PROCEDURE DIVISION .                                             00905026
009060*----------------------------------------------------------------*00906026
009070 A-MAIN                                      SECTION.             00907026
009080*----------------------------------------------------------------*00908026
009090 A-001.                                                           00909026
009100                                                                  00910026
009200         MOVE WS-COMPUTATIONAL              TO WS-NUMERIC-EDITED  00920026 
009300         MOVE WS-NUMERIC-EDITED-REDEFINED   TO WS-ALPHANUMERIC    00930026 

009200         MOVE WS-COMP3                     TO WS-COMP3-NUM        00920026 
009300         MOVE WS-COMP3-NUM                 TO WS-COMP3-ALNUM      00930026 
009400         DISPLAY "WS-COMP3-NUM"  WS-COMP3-NUM                     00940026
009500         DISPLAY "WS-COMP3-ALNUM"  WS-COMP3-ALNUM.                00950026


009400         DISPLAY "NUMERIC VALUE"  WS-NUMERIC-EDITED               00940026
009500         DISPLAY "ALPHANUMERIC VALUE"  WS-ALPHANUMERIC.           00950026

012300 A-999.                                                           01010026
012400     GOBACK.                                                      01020026
012500                                                                  01030026
