       program-id. Program1 as "Program1".

       environment division.
       configuration section.

       data division.
       working-storage section.

       procedure division.

       display "demo project hi"
           goback.

       end program Program1.
